Revit 2027 API
ParameterTypeId.BuildingCurveGstyle Property
 "Line Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BuildingCurveGstyle { get; }
Public Shared ReadOnly Property BuildingCurveGstyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BuildingCurveGstyle {
	ForgeTypeId^ get ();
}
static member BuildingCurveGstyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace